       IDENTIFICATION DIVISION.
       PROGRAM-ID.    SAMPLE.
       ENVIRONMENT    DIVISION.
       DATA           DIVISION.
       WORKING-STORAGE SECTION.
       01 MULTIPLIER   PIC 9(1).
       01 MULTIPLEE    PIC 9(1) VALUE 1.
       01 RESULT       PIC 9(2).

       PROCEDURE       DIVISION.
       DISPLAY "Please enter a multiplier.".
       ACCEPT MULTIPLIER.

       PERFORM VARYING MULTIPLEE FROM 1 BY 1 UNTIL MULTIPLEE > 9
          MULTIPLY MULTIPLIER BY MULTIPLEE GIVING RESULT
          DISPLAY "[" MULTIPLIER "*" MULTIPLEE "=" RESULT "]"
          IF MULTIPLEE = 9 THEN
             GOBACK
          END-IF
       END-PERFORM.

       END-PROGRAM SECTION.
       END PROGRAM SAMPLE.
